### Data Organization and Cleaning

In [113]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

### Read Data:
- Read hatch bill data
- Read hatch time spent data

In [114]:
hatch_bill_data = pd.read_csv("./clean_data/full_csv.csv")

In [115]:
hatch_bill_data.Tbl_.unique()

array(['14.0', '5.0', '15.0', '3.0', '1.0', '2.0', '19.0', '7.0', 'B3',
       '17.0', 'B1', '11.0', '16.0', '18.0', 'B2', 'B5', 'B4', '4.0',
       '8.0', '10.0', '6.0', '12.0', '9.0', 'B7', 'B6', '20.0', 'B8',
       'TBB5', 'TBB17', 'TBB4', 'TBB15', 'TBB18', 'TBB3', 'TBB20', 'TBB2',
       'TBB19', 'TBB12', 'TBB14', 'TBB6', 'TBB10', 'TBB7', 'TBB16',
       'TBB1', nan, 'TBB11', 'TBB8', 'TBB9', 'TBB13'], dtype=object)

In [116]:
hatch_bill_data.KotNo.unique()

array([14654., 14655., 14656., ..., 21601., 21617., 21642.])

In [117]:
# categorical data
categorical_cols = ["Classification","MenuGroup","ItemCode"]
# string cols
string_cols = ["Tbl_","BillNo","KotNo","Pax", "S_No"]

In [118]:
hatch_bill_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134302 entries, 0 to 134301
Data columns (total 23 columns):
S_No                 134292 non-null float64
BillDate_and_Time    134302 non-null object
BillNo               134292 non-null object
Tbl_                 134292 non-null object
Pax                  134292 non-null float64
KotNo                134292 non-null float64
KOTDate_and_Time     134302 non-null object
Steward              134292 non-null object
Classification       134302 non-null object
MenuGroup            134302 non-null object
ItemCode             134302 non-null float64
ItemName             134302 non-null object
Rate                 134302 non-null float64
Qty                  134302 non-null float64
Amount               134302 non-null float64
Discount             126551 non-null float64
CGS_2_5              84213 non-null float64
SGS_2_5              84213 non-null float64
Total                134302 non-null float64
UserID               134302 non-null object
PayMode              15242 non-null object
Tips                 15242 non-null float64
Restaurant           134302 non-null object
dtypes: float64(12), object(11)
memory usage: 23.6+ MB

In [119]:
for x in categorical_cols:
    hatch_bill_data[x] = hatch_bill_data[x].astype('category')
for x in string_cols:
    hatch_bill_data[x] = hatch_bill_data[x].astype(str)

In [120]:
hatch_bill_data['BillDate_and_Time'] = pd.to_datetime(hatch_bill_data.BillDate_and_Time)
hatch_bill_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134302 entries, 0 to 134301
Data columns (total 23 columns):
S_No                 134302 non-null object
BillDate_and_Time    134302 non-null datetime64[ns]
BillNo               134302 non-null object
Tbl_                 134302 non-null object
Pax                  134302 non-null object
KotNo                134302 non-null object
KOTDate_and_Time     134302 non-null object
Steward              134292 non-null object
Classification       134302 non-null category
MenuGroup            134302 non-null category
ItemCode             134302 non-null category
ItemName             134302 non-null object
Rate                 134302 non-null float64
Qty                  134302 non-null float64
Amount               134302 non-null float64
Discount             126551 non-null float64
CGS_2_5              84213 non-null float64
SGS_2_5              84213 non-null float64
Total                134302 non-null float64
UserID               134302 non-null object
PayMode              15242 non-null object
Tips                 15242 non-null float64
Restaurant           134302 non-null object
dtypes: category(3), datetime64[ns](1), float64(8), object(11)
memory usage: 21.0+ MB

In [121]:
hatch_bill_data.Discount.fillna(0,inplace=True)
hatch_bill_data.CGS_2_5.fillna(0,inplace=True)
hatch_bill_data.SGS_2_5.fillna(0,inplace=True)

In [122]:
hatch_bill_data.Tbl_.unique()

array(['14.0', '5.0', '15.0', '3.0', '1.0', '2.0', '19.0', '7.0', 'B3',
       '17.0', 'B1', '11.0', '16.0', '18.0', 'B2', 'B5', 'B4', '4.0',
       '8.0', '10.0', '6.0', '12.0', '9.0', 'B7', 'B6', '20.0', 'B8',
       'TBB5', 'TBB17', 'TBB4', 'TBB15', 'TBB18', 'TBB3', 'TBB20', 'TBB2',
       'TBB19', 'TBB12', 'TBB14', 'TBB6', 'TBB10', 'TBB7', 'TBB16',
       'TBB1', 'nan', 'TBB11', 'TBB8', 'TBB9', 'TBB13'], dtype=object)

In [123]:
# hatch_bill_data.Pax = hatch_bill_data.Pax.str.strip('.0')
# hatch_bill_data.Tbl_ = hatch_bill_data.Tbl_.str.replace('.0','',1)
# hatch_bill_data.Tbl_.unique()

p = hatch_bill_data.Tbl_.str.split('.')
hatch_bill_data.Tbl_ = [p[i][0] for i in range(len(p))]
hatch_bill_data.Tbl_.unique()

array(['14', '5', '15', '3', '1', '2', '19', '7', 'B3', '17', 'B1', '11',
       '16', '18', 'B2', 'B5', 'B4', '4', '8', '10', '6', '12', '9', 'B7',
       'B6', '20', 'B8', 'TBB5', 'TBB17', 'TBB4', 'TBB15', 'TBB18',
       'TBB3', 'TBB20', 'TBB2', 'TBB19', 'TBB12', 'TBB14', 'TBB6',
       'TBB10', 'TBB7', 'TBB16', 'TBB1', 'nan', 'TBB11', 'TBB8', 'TBB9',
       'TBB13'], dtype=object)

In [124]:
b = '10.0'

In [125]:
b.split('.')

['10', '0']

In [126]:
hatch_bill_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134302 entries, 0 to 134301
Data columns (total 23 columns):
S_No                 134302 non-null object
BillDate_and_Time    134302 non-null datetime64[ns]
BillNo               134302 non-null object
Tbl_                 134302 non-null object
Pax                  134302 non-null object
KotNo                134302 non-null object
KOTDate_and_Time     134302 non-null object
Steward              134292 non-null object
Classification       134302 non-null category
MenuGroup            134302 non-null category
ItemCode             134302 non-null category
ItemName             134302 non-null object
Rate                 134302 non-null float64
Qty                  134302 non-null float64
Amount               134302 non-null float64
Discount             134302 non-null float64
CGS_2_5              134302 non-null float64
SGS_2_5              134302 non-null float64
Total                134302 non-null float64
UserID               134302 non-null object
PayMode              15242 non-null object
Tips                 15242 non-null float64
Restaurant           134302 non-null object
dtypes: category(3), datetime64[ns](1), float64(8), object(11)
memory usage: 21.0+ MB

In [127]:
hatch_bill_data.head()

,S_No,BillDate_and_Time,BillNo,Tbl_,Pax,KotNo,KOTDate_and_Time,Steward,Classification,MenuGroup,...,Qty,Amount,Discount,CGS_2_5,SGS_2_5,Total,UserID,PayMode,Tips,Restaurant
0,1.0,2019-01-23 14:26:00,HEJ3273,14,4.0,14654.0,2019-01-23T13:35:00,Ganesh,Food,Vegetarian Starters,...,1.0,235.0,0.0,5.88,5.88,246.76,NAGESH,NaN,NaN,The Estate
1,1.0,2019-01-23 14:26:00,HEJ3273,14,4.0,14654.0,2019-01-23T13:35:00,Ganesh,Food,Vegetarian Starters,...,1.0,245.0,0.0,6.13,6.13,257.26,NAGESH,NaN,NaN,The Estate
2,1.0,2019-01-23 14:26:00,HEJ3273,14,4.0,14654.0,2019-01-23T13:35:00,Ganesh,Food,Non Vegetarian Starters,...,1.0,245.0,0.0,6.13,6.13,257.26,NAGESH,NaN,NaN,The Estate
3,1.0,2019-01-23 14:26:00,HEJ3273,14,4.0,14654.0,2019-01-23T13:35:00,Ganesh,Others,Soft Beverages,...,1.0,20.0,0.0,0.50,0.50,21.00,NAGESH,NaN,NaN,The Estate
4,1.0,2019-01-23 14:26:00,HEJ3273,14,4.0,14654.0,2019-01-23T13:35:00,Ganesh,Food,Bread,...,1.0,75.0,0.0,1.88,1.88,78.76,NAGESH,NaN,NaN,The Estate

In [128]:
import sqlite3
conn = sqlite3.connect('hatch.db')
hatch_bill_data.to_sql('hatch_bill_data',conn,if_exists='append', index=False)
conn.close()

In [129]:
hatch_kot_data = pd.read_csv("./clean_data/full_csv_kot.csv")

In [130]:
hatch_kot_data.head()

,Restaurant,Tbl_,Pax,BillNo,BillDate_and_Time,KotOrderNo,KOTOrderDateAndTime,Steward,ItemName,Qty,PayMode,SettlementDateTime,UserId
0,Timber,B1,1.0,5442.0,2019-03-01T11:48:00,20462.0,2019-03-01T11:40:00,Amalnathan,ROYAL STAG,3.0,Cash,2019-03-01T19:27:00,AMALNATHAN
1,Timber,B1,1.0,5442.0,2019-03-01T11:48:00,20462.0,2019-03-01T11:40:00,Amalnathan,Soda,1.0,Cash,2019-03-01T19:27:00,AMALNATHAN
2,Timber,2,2.0,5443.0,2019-03-01T14:35:00,20463.0,2019-03-01T13:08:00,Amalnathan,Budweiser Draught Mug (p),2.0,Cash,2019-03-01T18:12:00,GANESH
3,Timber,2,2.0,5443.0,2019-03-01T14:35:00,20463.0,2019-03-01T13:08:00,Amalnathan,Budweiser Draught Mug (p),1.0,Cash,2019-03-01T18:12:00,GANESH
4,Timber,2,2.0,5443.0,2019-03-01T14:35:00,20463.0,2019-03-01T13:08:00,Amalnathan,Guntoor Chicken,1.0,Cash,2019-03-01T18:12:00,GANESH

In [131]:
hatch_kot_data.info()
# hatch_kot_data.Pax = hatch_kot_data.Pax.astype(str)
# hatch_kot_data.Pax = hatch_kot_data.Pax.str.strip('.0')
# hatch_kot_data.KotOrderNo = hatch_kot_data.KotOrderNo.astype(str)
# hatch_kot_data.KotOrderNo = hatch_kot_data.KotOrderNo.str.strip('.0')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134302 entries, 0 to 134301
Data columns (total 13 columns):
Restaurant             134302 non-null object
Tbl_                   134302 non-null object
Pax                    134297 non-null float64
BillNo                 134297 non-null float64
BillDate_and_Time      134302 non-null object
KotOrderNo             134302 non-null float64
KOTOrderDateAndTime    134302 non-null object
Steward                134302 non-null object
ItemName               134302 non-null object
Qty                    134302 non-null float64
PayMode                134297 non-null object
SettlementDateTime     134302 non-null object
UserId                 134297 non-null object
dtypes: float64(4), object(9)
memory usage: 13.3+ MB

In [132]:
# categorical data
categorical_cols = ["PayMode","Tbl_"]
# integer types
str_cols = ["BillNo","KotOrderNo", "Pax"]

for x in categorical_cols:
    hatch_kot_data[x] = hatch_kot_data[x].astype('category')
for x in str_cols:
    hatch_kot_data[x] = hatch_kot_data[x].astype(str)

In [133]:
hatch_kot_data.head()

,Restaurant,Tbl_,Pax,BillNo,BillDate_and_Time,KotOrderNo,KOTOrderDateAndTime,Steward,ItemName,Qty,PayMode,SettlementDateTime,UserId
0,Timber,B1,1.0,5442.0,2019-03-01T11:48:00,20462.0,2019-03-01T11:40:00,Amalnathan,ROYAL STAG,3.0,Cash,2019-03-01T19:27:00,AMALNATHAN
1,Timber,B1,1.0,5442.0,2019-03-01T11:48:00,20462.0,2019-03-01T11:40:00,Amalnathan,Soda,1.0,Cash,2019-03-01T19:27:00,AMALNATHAN
2,Timber,2,2.0,5443.0,2019-03-01T14:35:00,20463.0,2019-03-01T13:08:00,Amalnathan,Budweiser Draught Mug (p),2.0,Cash,2019-03-01T18:12:00,GANESH
3,Timber,2,2.0,5443.0,2019-03-01T14:35:00,20463.0,2019-03-01T13:08:00,Amalnathan,Budweiser Draught Mug (p),1.0,Cash,2019-03-01T18:12:00,GANESH
4,Timber,2,2.0,5443.0,2019-03-01T14:35:00,20463.0,2019-03-01T13:08:00,Amalnathan,Guntoor Chicken,1.0,Cash,2019-03-01T18:12:00,GANESH

In [134]:
hatch_kot_data.BillDate_and_Time = pd.to_datetime(hatch_kot_data.BillDate_and_Time)
hatch_kot_data.KOTOrderDateAndTime = pd.to_datetime(hatch_kot_data.KOTOrderDateAndTime)
hatch_kot_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134302 entries, 0 to 134301
Data columns (total 13 columns):
Restaurant             134302 non-null object
Tbl_                   134302 non-null category
Pax                    134302 non-null object
BillNo                 134302 non-null object
BillDate_and_Time      134302 non-null datetime64[ns]
KotOrderNo             134302 non-null object
KOTOrderDateAndTime    134302 non-null datetime64[ns]
Steward                134302 non-null object
ItemName               134302 non-null object
Qty                    134302 non-null float64
PayMode                134297 non-null category
SettlementDateTime     134302 non-null object
UserId                 134297 non-null object
dtypes: category(2), datetime64[ns](2), float64(1), object(8)
memory usage: 11.5+ MB

In [135]:
import sqlite3

In [136]:
conn = sqlite3.connect('hatch.db')

In [137]:
# hatch_bill_data.to_sql('hatch_bill_data',conn,if_exists='replace', index=False)
hatch_kot_data.to_sql('hatch_kot_data',conn,if_exists='append', index=False)

In [138]:
conn.close()

In [47]:
items = pd.read_excel('Item Codes.xlsx')

In [26]:
items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 410 entries, 0 to 409
Data columns (total 5 columns):
Classification    410 non-null object
MenuGroup         410 non-null object
ItemCode          410 non-null int64
ItemName          410 non-null object
Kitchen           0 non-null float64
dtypes: float64(1), int64(1), object(3)
memory usage: 16.1+ KB

In [27]:
items.drop(columns='Kitchen', inplace=True)
items.head()

  Classification MenuGroup  ItemCode                   ItemName
0           Food    Salads         1         GREEN SALAD STICKS
1           Food    Salads         2            Mixed Bean Usli
2           Food    Salads         3           Koshambari Salad
3           Food    Salads         5  Watermelon And Feta Salad
4           Food    Salads         6               Caesar Salad

In [28]:
conn = sqlite3.connect('hatch.db')
items.to_sql('items_table',conn,if_exists='replace', index=False)
conn.close()